NordicPlayground/nrf52-quadcopter/Firmware/drivers/mpu6500.c
  // Restore old configuration
  i2cdev_writeByte(devAddr, MPU6500_RA_SMPLRT_DIV, saveReg[0]);
  i2cdev_writeByte(devAddr, MPU6500_RA_CONFIG, saveReg[1]);
  i2cdev_writeByte(devAddr, MPU6500_RA_GYRO_CONFIG, saveReg[2]);
  i2cdev_writeByte(devAddr, MPU6500_RA_ACCEL_CONFIG_2, saveReg[3]);
  i2cdev_writeByte(devAddr, MPU6500_RA_ACCEL_CONFIG, saveReg[4]);

   // Check result
  if (mpu6500EvaluateSelfTest(MPU6500_ST_GYRO_LOW, MPU6500_ST_GYRO_HIGH, gDiff[0], "gyro X") &&
      mpu6500EvaluateSelfTest(MPU6500_ST_GYRO_LOW, MPU6500_ST_GYRO_HIGH, gDiff[1], "gyro Y") &&
      mpu6500EvaluateSelfTest(MPU6500_ST_GYRO_LOW, MPU6500_ST_GYRO_HIGH, gDiff[2], "gyro Z") &&
      mpu6500EvaluateSelfTest(MPU6500_ST_ACCEL_LOW, MPU6500_ST_ACCEL_HIGH, aDiff[0], "acc X") &&
      mpu6500EvaluateSelfTest(MPU6500_ST_ACCEL_LOW, MPU6500_ST_ACCEL_HIGH, aDiff[1], "acc Y") &&
      mpu6500EvaluateSelfTest(MPU6500_ST_ACCEL_LOW, MPU6500_ST_ACCEL_HIGH, aDiff[2], "acc Z"))
  {
    testStatus = true;
    printf("Self test [OK].\n");
  }

  return testStatus;
}

/** Evaluate the values from a MPU6500 self test.
 * @param low The low limit of the self test
 * @param high The high limit of the self test
 * @param value The value to compare with.
 * @param string A pointer to a string describing the value.
 * @return True if self test within low - high limit, false otherwise
 */
bool mpu6500EvaluateSelfTest(float low, float high, float value, char* string)
{
  if (value < low || value > high)
  {
    printf("Self test %s [FAIL]. low: %0.2f, high: %0.2f, measured: %0.2f\n",
                string, low, high, value);
    return false;
  }
  return true;
}

// SMPLRT_DIV register

/** Get gyroscope output rate divider.
 * The sensor register output, FIFO output, DMP sampling, Motion detection, Zero
 * Motion detection, and Free Fall detection are all based on the Sample Rate.
 * The Sample Rate is generated by dividing the gyroscope output rate by
 * SMPLRT_DIV:
 *
 * Sample Rate = Gyroscope Output Rate / (1 + SMPLRT_DIV)
 *
 * where Gyroscope Output Rate = 8kHz when the DLPF is disabled (DLPF_CFG = 0 or
 * 7), and 1kHz when the DLPF is enabled (see Register 26).
 *
 * Note: The accelerometer output rate is 1kHz. This means that for a Sample
 * Rate greater than 1kHz, the same accelerometer sample may be output to the
 * FIFO, DMP, and sensor registers more than once.
 *
 * For a diagram of the gyroscope and accelerometer signal paths, see Section 8
 * of the MPU-6000/MPU-6500 Product Specification document.
 *
 * @return Current sample rate
 * @see MPU6500_RA_SMPLRT_DIV
 */
uint8_t mpu6500GetRate()
{
  i2cdev_readByte(devAddr, MPU6500_RA_SMPLRT_DIV, buffer);
  return buffer[0];
}
/** Set gyroscope sample rate divider.
 * @param rate New sample rate divider
 * @see getRate()
 * @see MPU6500_RA_SMPLRT_DIV
 */
void mpu6500SetRate(uint8_t rate)
{
  i2cdev_writeByte(devAddr, MPU6500_RA_SMPLRT_DIV, rate);
}

// CONFIG register

/** Get external FSYNC configuration.
 * Configures the external Frame Synchronization (FSYNC) pin sampling. An
 * external signal connected to the FSYNC pin can be sampled by configuring
 * EXT_SYNC_SET. Signal changes to the FSYNC pin are latched so that short
 * strobes may be captured. The latched FSYNC signal will be sampled at the
 * Sampling Rate, as defined in register 25. After sampling, the latch will
 * reset to the current FSYNC signal state.
 *
 * The sampled value will be reported in place of the least significant bit in
 * a sensor data register determined by the value of EXT_SYNC_SET according to
 * the following table.
 *
 * <pre>
 * EXT_SYNC_SET | FSYNC Bit Location
 * -------------+-------------------
 * 0            | Input disabled
 * 1            | TEMP_OUT_L[0]
 * 2            | GYRO_XOUT_L[0]
 * 3            | GYRO_YOUT_L[0]
 * 4            | GYRO_ZOUT_L[0]
 * 5            | ACCEL_XOUT_L[0]
 * 6            | ACCEL_YOUT_L[0]
 * 7            | ACCEL_ZOUT_L[0]
 * </pre>
 *
 * @return FSYNC configuration value
 */
uint8_t mpu6500GetExternalFrameSync()
{
  i2cdev_readBits(devAddr, MPU6500_RA_CONFIG, MPU6500_CFG_EXT_SYNC_SET_BIT,
      MPU6500_CFG_EXT_SYNC_SET_LENGTH, buffer);
  return buffer[0];
}
/** Set external FSYNC configuration.
 * @see getExternalFrameSync()
 * @see MPU6500_RA_CONFIG
 * @param sync New FSYNC configuration value
 */
void mpu6500SetExternalFrameSync(uint8_t sync)
{
  i2cdev_writeBits(devAddr, MPU6500_RA_CONFIG, MPU6500_CFG_EXT_SYNC_SET_BIT,
      MPU6500_CFG_EXT_SYNC_SET_LENGTH, sync);
}
/** Get digital low-pass filter configuration.
 * The DLPF_CFG parameter sets the digital low pass filter configuration. It
 * also determines the internal sampling rate used by the device as shown in
 * the table below.
 *
 * Note: The accelerometer output rate is 1kHz. This means that for a Sample
 * Rate greater than 1kHz, the same accelerometer sample may be output to the
 * FIFO, DMP, and sensor registers more than once.
 *
 * <pre>
 *          |   ACCELEROMETER    |           GYROSCOPE
 * DLPF_CFG | Bandwidth | Delay  | Bandwidth | Delay  | Sample Rate
 * ---------+-----------+--------+-----------+--------+-------------
 * 0        | 260Hz     | 0ms    | 256Hz     | 0.98ms | 8kHz
 * 1        | 184Hz     | 2.0ms  | 188Hz     | 1.9ms  | 1kHz
 * 2        | 94Hz      | 3.0ms  | 98Hz      | 2.8ms  | 1kHz
 * 3        | 44Hz      | 4.9ms  | 42Hz      | 4.8ms  | 1kHz
 * 4        | 21Hz      | 8.5ms  | 20Hz      | 8.3ms  | 1kHz
 * 5        | 10Hz      | 13.8ms | 10Hz      | 13.4ms | 1kHz
 * 6        | 5Hz       | 19.0ms | 5Hz       | 18.6ms | 1kHz
 * 7        |   -- Reserved --   |   -- Reserved --   | Reserved
 * </pre>
 *
 * @return DLFP configuration
 * @see MPU6500_RA_CONFIG
 * @see MPU6500_CFG_DLPF_CFG_BIT
 * @see MPU6500_CFG_DLPF_CFG_LENGTH
 */
uint8_t mpu6500GetDLPFMode()
{
  i2cdev_readBits(devAddr, MPU6500_RA_CONFIG, MPU6500_CFG_DLPF_CFG_BIT,
      MPU6500_CFG_DLPF_CFG_LENGTH, buffer);
  return buffer[0];
}
/** Set digital low-pass filter configuration.
 * @param mode New DLFP configuration setting
 * @see getDLPFBandwidth()
 * @see MPU6500_DLPF_BW_256
 * @see MPU6500_RA_CONFIG
 * @see MPU6500_CFG_DLPF_CFG_BIT
 * @see MPU6500_CFG_DLPF_CFG_LENGTH
 */
void mpu6500SetDLPFMode(uint8_t mode)
{
  i2cdev_writeBits(devAddr, MPU6500_RA_CONFIG, MPU6500_CFG_DLPF_CFG_BIT,
      MPU6500_CFG_DLPF_CFG_LENGTH, mode);
}

