NordicPlayground/nrf52-quadcopter/Firmware/drivers/mpu6500.c
// GYRO_CONFIG register

/** Get full-scale gyroscope range id.
 * The FS_SEL parameter allows setting the full-scale range of the gyro sensors,
 * as described in the table below.
 *
 * <pre>
 * 0 = +/- 250 degrees/sec
 * 1 = +/- 500 degrees/sec
 * 2 = +/- 1000 degrees/sec
 * 3 = +/- 2000 degrees/sec
 * </pre>
 *
 * @return Current full-scale gyroscope range setting
 * @see MPU6500_GYRO_FS_250
 * @see MPU6500_RA_GYRO_CONFIG
 * @see MPU6500_GCONFIG_FS_SEL_BIT
 * @see MPU6500_GCONFIG_FS_SEL_LENGTH
 */
uint8_t mpu6500GetFullScaleGyroRangeId()
{
  i2cdev_readBits(devAddr, MPU6500_RA_GYRO_CONFIG, MPU6500_GCONFIG_FS_SEL_BIT,
      MPU6500_GCONFIG_FS_SEL_LENGTH, buffer);
  return buffer[0];
}

/** Get full-scale gyroscope degrees per LSB.
 *
 * @return float of current full-scale gyroscope setting as degrees per LSB
 * @see MPU6500_GYRO_FS_250
 * @see MPU6500_RA_GYRO_CONFIG
 * @see MPU6500_GCONFIG_FS_SEL_BIT
 * @see MPU6500_GCONFIG_FS_SEL_LENGTH
 */
float mpu6500GetFullScaleGyroDPL()
{
  int32_t rangeId;
  float range;

  rangeId = mpu6500GetFullScaleGyroRangeId();
  switch (rangeId)
  {
    case MPU6500_GYRO_FS_250:
      range = MPU6500_DEG_PER_LSB_250;
      break;
    case MPU6500_GYRO_FS_500:
      range = MPU6500_DEG_PER_LSB_500;
      break;
    case MPU6500_GYRO_FS_1000:
      range = MPU6500_DEG_PER_LSB_1000;
      break;
    case MPU6500_GYRO_FS_2000:
      range = MPU6500_DEG_PER_LSB_2000;
      break;
    default:
      range = MPU6500_DEG_PER_LSB_1000;
      break;
  }

  return range;
}

/** Set full-scale gyroscope range.
 * @param range New full-scale gyroscope range value
 * @see getFullScaleRange()
 * @see MPU6500_GYRO_FS_250
 * @see MPU6500_RA_GYRO_CONFIG
 * @see MPU6500_GCONFIG_FS_SEL_BIT
 * @see MPU6500_GCONFIG_FS_SEL_LENGTH
 */
void mpu6500SetFullScaleGyroRange(uint8_t range)
{
  i2cdev_writeBits(devAddr, MPU6500_RA_GYRO_CONFIG, MPU6500_GCONFIG_FS_SEL_BIT,
      MPU6500_GCONFIG_FS_SEL_LENGTH, range);
}

void mpu6500SetGyroXSelfTest(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_GYRO_CONFIG, MPU6500_GCONFIG_XG_ST_BIT, enabled);
}

void mpu6500SetGyroYSelfTest(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_GYRO_CONFIG, MPU6500_GCONFIG_YG_ST_BIT, enabled);
}

void mpu6500SetGyroZSelfTest(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_GYRO_CONFIG, MPU6500_GCONFIG_ZG_ST_BIT, enabled);
}

// ACCEL_CONFIG register

/** Get self-test enabled setting for accelerometer X axis.
 * @return Self-test enabled value
 * @see MPU6500_RA_ACCEL_CONFIG
 */
bool mpu6500GetAccelXSelfTest()
{
  i2cdev_readBit(devAddr, MPU6500_RA_ACCEL_CONFIG, MPU6500_ACONFIG_XA_ST_BIT, buffer);
  return buffer[0];
}
/** Get self-test enabled setting for accelerometer X axis.
 * @param enabled Self-test enabled value
 * @see MPU6500_RA_ACCEL_CONFIG
 */
void mpu6500SetAccelXSelfTest(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_ACCEL_CONFIG, MPU6500_ACONFIG_XA_ST_BIT, enabled);
}
/** Get self-test enabled value for accelerometer Y axis.
 * @return Self-test enabled value
 * @see MPU6500_RA_ACCEL_CONFIG
 */
bool mpu6500GetAccelYSelfTest()
{
  i2cdev_readBit(devAddr, MPU6500_RA_ACCEL_CONFIG, MPU6500_ACONFIG_YA_ST_BIT, buffer);
  return buffer[0];
}
/** Get self-test enabled value for accelerometer Y axis.
 * @param enabled Self-test enabled value
 * @see MPU6500_RA_ACCEL_CONFIG
 */
void mpu6500SetAccelYSelfTest(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_ACCEL_CONFIG, MPU6500_ACONFIG_YA_ST_BIT, enabled);
}
/** Get self-test enabled value for accelerometer Z axis.
 * @return Self-test enabled value
 * @see MPU6500_RA_ACCEL_CONFIG
 */
bool mpu6500GetAccelZSelfTest()
{
  i2cdev_readBit(devAddr, MPU6500_RA_ACCEL_CONFIG, MPU6500_ACONFIG_ZA_ST_BIT, buffer);
  return buffer[0];
}
/** Set self-test enabled value for accelerometer Z axis.
 * @param enabled Self-test enabled value
 * @see MPU6500_RA_ACCEL_CONFIG
 */
void mpu6500SetAccelZSelfTest(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_ACCEL_CONFIG, MPU6500_ACONFIG_ZA_ST_BIT, enabled);
}
/** Get full-scale accelerometer range.
 * The FS_SEL parameter allows setting the full-scale range of the accelerometer
 * sensors, as described in the table below.
 *
 * <pre>
 * 0 = +/- 2g
 * 1 = +/- 4g
 * 2 = +/- 8g
 * 3 = +/- 16g
 * </pre>
 *
 * @return Current full-scale accelerometer range setting
 * @see MPU6500_ACCEL_FS_2
 * @see MPU6500_RA_ACCEL_CONFIG
 * @see MPU6500_ACONFIG_AFS_SEL_BIT
 * @see MPU6500_ACONFIG_AFS_SEL_LENGTH
 */
uint8_t mpu6500GetFullScaleAccelRangeId()
{
  i2cdev_readBits(devAddr, MPU6500_RA_ACCEL_CONFIG, MPU6500_ACONFIG_AFS_SEL_BIT,
      MPU6500_ACONFIG_AFS_SEL_LENGTH, buffer);
  return buffer[0];
}

/** Get full-scale accelerometer G per LSB.
 *
 * @return float of current full-scale accelerometer setting as G per LSB
 * @see MPU6500_ACCEL_FS_2
 * @see MPU6500_RA_ACCEL_CONFIG
 * @see MPU6500_ACONFIG_AFS_SEL_BIT
 * @see MPU6500_ACONFIG_AFS_SEL_LENGTH
 */
float mpu6500GetFullScaleAccelGPL()
{
  int32_t rangeId;
  float range;

  rangeId = mpu6500GetFullScaleAccelRangeId();
  switch (rangeId)
  {
    case MPU6500_ACCEL_FS_2:
      range = MPU6500_G_PER_LSB_2;
      break;
    case MPU6500_ACCEL_FS_4:
      range = MPU6500_G_PER_LSB_4;
      break;
    case MPU6500_ACCEL_FS_8:
      range = MPU6500_G_PER_LSB_8;
      break;
    case MPU6500_ACCEL_FS_16:
      range = MPU6500_G_PER_LSB_16;
      break;
    default:
      range = MPU6500_DEG_PER_LSB_1000;
      break;
  }

  return range;
}

/** Set full-scale accelerometer range.
 * @param range New full-scale accelerometer range setting
 * @see getFullScaleAccelRange()
 */
void mpu6500SetFullScaleAccelRange(uint8_t range)
{
  i2cdev_writeBits(devAddr, MPU6500_RA_ACCEL_CONFIG, MPU6500_ACONFIG_AFS_SEL_BIT,
      MPU6500_ACONFIG_AFS_SEL_LENGTH, range);
}
/** Get the high-pass filter configuration.
 * The DHPF is a filter module in the path leading to motion detectors (Free
 * Fall, Motion threshold, and Zero Motion). The high pass filter output is not
 * available to the data registers (see Figure in Section 8 of the MPU-6000/
 * MPU-6500 Product Specification document).
 *
 * The high pass filter has three modes:
 *
 * <pre>
 *    Reset: The filter output settles to zero within one sample. This
 *           effectively disables the high pass filter. This mode may be toggled
 *           to quickly settle the filter.
 *
 *    On:    The high pass filter will pass signals above the cut off frequency.
 *
 *    Hold:  When triggered, the filter holds the present sample. The filter
 *           output will be the difference between the input sample and the held
 *           sample.
 * </pre>
 *
 * <pre>
 * ACCEL_HPF | Filter Mode | Cut-off Frequency
 * ----------+-------------+------------------
 * 0         | Reset       | None
 * 1         | On          | 5Hz
 * 2         | On          | 2.5Hz
 * 3         | On          | 1.25Hz
 * 4         | On          | 0.63Hz
 * 7         | Hold        | None
 * </pre>
 *
 * @return Current high-pass filter configuration
 * @see MPU6500_DHPF_RESET
 * @see MPU6500_RA_ACCEL_CONFIG
 */
uint8_t mpu6500GetDHPFMode()
{
  i2cdev_readBits(devAddr, MPU6500_RA_ACCEL_CONFIG, MPU6500_ACONFIG_ACCEL_HPF_BIT,
      MPU6500_ACONFIG_ACCEL_HPF_LENGTH, buffer);
  return buffer[0];
}
/** Set the high-pass filter configuration.
 * @param bandwidth New high-pass filter configuration
 * @see setDHPFMode()
 * @see MPU6500_DHPF_RESET
 * @see MPU6500_RA_ACCEL_CONFIG
 */
void mpu6500SetDHPFMode(uint8_t bandwidth)
{
  i2cdev_writeBits(devAddr, MPU6500_RA_ACCEL_CONFIG, MPU6500_ACONFIG_ACCEL_HPF_BIT,
      MPU6500_ACONFIG_ACCEL_HPF_LENGTH, bandwidth);
}

// FIFO_EN register

/** Get temperature FIFO enabled value.
 * When set to 1, this bit enables TEMP_OUT_H and TEMP_OUT_L (Registers 65 and
 * 66) to be written into the FIFO buffer.
 * @return Current temperature FIFO enabled value
 * @see MPU6500_RA_FIFO_EN
 */
bool mpu6500GetTempFIFOEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_TEMP_FIFO_EN_BIT, buffer);
  return buffer[0];
}
/** Set temperature FIFO enabled value.
 * @param enabled New temperature FIFO enabled value
 * @see getTempFIFOEnabled()
 * @see MPU6500_RA_FIFO_EN
 */
void mpu6500SetTempFIFOEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_TEMP_FIFO_EN_BIT, enabled);
}
/** Get gyroscope X-axis FIFO enabled value.
 * When set to 1, this bit enables GYRO_XOUT_H and GYRO_XOUT_L (Registers 67 and
 * 68) to be written into the FIFO buffer.
 * @return Current gyroscope X-axis FIFO enabled value
 * @see MPU6500_RA_FIFO_EN
 */
bool mpu6500GetXGyroFIFOEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_XG_FIFO_EN_BIT, buffer);
  return buffer[0];
}
/** Set gyroscope X-axis FIFO enabled value.
 * @param enabled New gyroscope X-axis FIFO enabled value
 * @see getXGyroFIFOEnabled()
 * @see MPU6500_RA_FIFO_EN
 */
void mpu6500SetXGyroFIFOEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_XG_FIFO_EN_BIT, enabled);
}
/** Get gyroscope Y-axis FIFO enabled value.
 * When set to 1, this bit enables GYRO_YOUT_H and GYRO_YOUT_L (Registers 69 and
 * 70) to be written into the FIFO buffer.
 * @return Current gyroscope Y-axis FIFO enabled value
 * @see MPU6500_RA_FIFO_EN
 */
bool mpu6500GetYGyroFIFOEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_YG_FIFO_EN_BIT, buffer);
  return buffer[0];
}
/** Set gyroscope Y-axis FIFO enabled value.
 * @param enabled New gyroscope Y-axis FIFO enabled value
 * @see getYGyroFIFOEnabled()
 * @see MPU6500_RA_FIFO_EN
 */
void mpu6500SetYGyroFIFOEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_YG_FIFO_EN_BIT, enabled);
}
/** Get gyroscope Z-axis FIFO enabled value.
 * When set to 1, this bit enables GYRO_ZOUT_H and GYRO_ZOUT_L (Registers 71 and
 * 72) to be written into the FIFO buffer.
 * @return Current gyroscope Z-axis FIFO enabled value
 * @see MPU6500_RA_FIFO_EN
 */
bool mpu6500GetZGyroFIFOEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_ZG_FIFO_EN_BIT, buffer);
  return buffer[0];
}
/** Set gyroscope Z-axis FIFO enabled value.
 * @param enabled New gyroscope Z-axis FIFO enabled value
 * @see getZGyroFIFOEnabled()
 * @see MPU6500_RA_FIFO_EN
 */
void mpu6500SetZGyroFIFOEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_ZG_FIFO_EN_BIT, enabled);
}
/** Get accelerometer FIFO enabled value.
 * When set to 1, this bit enables ACCEL_XOUT_H, ACCEL_XOUT_L, ACCEL_YOUT_H,
 * ACCEL_YOUT_L, ACCEL_ZOUT_H, and ACCEL_ZOUT_L (Registers 59 to 64) to be
 * written into the FIFO buffer.
 * @return Current accelerometer FIFO enabled value
 * @see MPU6500_RA_FIFO_EN
 */
bool mpu6500GetAccelFIFOEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_ACCEL_FIFO_EN_BIT, buffer);
  return buffer[0];
}
/** Set accelerometer FIFO enabled value.
 * @param enabled New accelerometer FIFO enabled value
 * @see getAccelFIFOEnabled()
 * @see MPU6500_RA_FIFO_EN
 */
void mpu6500SetAccelFIFOEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_ACCEL_FIFO_EN_BIT, enabled);
}
/** Get Slave 2 FIFO enabled value.
 * When set to 1, this bit enables EXT_SENS_DATA registers (Registers 73 to 96)
 * associated with Slave 2 to be written into the FIFO buffer.
 * @return Current Slave 2 FIFO enabled value
 * @see MPU6500_RA_FIFO_EN
 */
bool mpu6500GetSlave2FIFOEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_SLV2_FIFO_EN_BIT, buffer);
  return buffer[0];
}
/** Set Slave 2 FIFO enabled value.
 * @param enabled New Slave 2 FIFO enabled value
 * @see getSlave2FIFOEnabled()
 * @see MPU6500_RA_FIFO_EN
 */
void mpu6500SetSlave2FIFOEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_SLV2_FIFO_EN_BIT, enabled);
}
/** Get Slave 1 FIFO enabled value.
 * When set to 1, this bit enables EXT_SENS_DATA registers (Registers 73 to 96)
 * associated with Slave 1 to be written into the FIFO buffer.
 * @return Current Slave 1 FIFO enabled value
 * @see MPU6500_RA_FIFO_EN
 */
bool mpu6500GetSlave1FIFOEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_SLV1_FIFO_EN_BIT, buffer);
  return buffer[0];
}
/** Set Slave 1 FIFO enabled value.
 * @param enabled New Slave 1 FIFO enabled value
 * @see getSlave1FIFOEnabled()
 * @see MPU6500_RA_FIFO_EN
 */
void mpu6500SetSlave1FIFOEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_SLV1_FIFO_EN_BIT, enabled);
}
/** Get Slave 0 FIFO enabled value.
 * When set to 1, this bit enables EXT_SENS_DATA registers (Registers 73 to 96)
 * associated with Slave 0 to be written into the FIFO buffer.
 * @return Current Slave 0 FIFO enabled value
 * @see MPU6500_RA_FIFO_EN
 */
bool mpu6500GetSlave0FIFOEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_SLV0_FIFO_EN_BIT, buffer);
  return buffer[0];
}
/** Set Slave 0 FIFO enabled value.
 * @param enabled New Slave 0 FIFO enabled value
 * @see getSlave0FIFOEnabled()
 * @see MPU6500_RA_FIFO_EN
 */
void mpu6500SetSlave0FIFOEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_FIFO_EN, MPU6500_SLV0_FIFO_EN_BIT, enabled);
}

// I2C_MST_CTRL register

/** Get multi-master enabled value.
 * Multi-master capability allows multiple I2C masters to operate on the same
 * bus. In circuits where multi-master capability is required, set MULT_MST_EN
 * to 1. This will increase current drawn by approximately 30uA.
 *
 * In circuits where multi-master capability is required, the state of the I2C
 * bus must always be monitored by each separate I2C Master. Before an I2C
 * Master can assume arbitration of the bus, it must first confirm that no other
 * I2C Master has arbitration of the bus. When MULT_MST_EN is set to 1, the
 * MPU-60X0's bus arbitration detection logic is turned on, enabling it to
 * detect when the bus is available.
 *
 * @return Current multi-master enabled value
 * @see MPU6500_RA_I2C_MST_CTRL
 */
bool mpu6500GetMultiMasterEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_CTRL, MPU6500_MULT_MST_EN_BIT, buffer);
  return buffer[0];
}
/** Set multi-master enabled value.
 * @param enabled New multi-master enabled value
 * @see getMultiMasterEnabled()
 * @see MPU6500_RA_I2C_MST_CTRL
 */
void mpu6500SetMultiMasterEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_I2C_MST_CTRL, MPU6500_MULT_MST_EN_BIT, enabled);
}
/** Get wait-for-external-sensor-data enabled value.
 * When the WAIT_FOR_ES bit is set to 1, the Data Ready interrupt will be
 * delayed until External Sensor data from the Slave Devices are loaded into the
 * EXT_SENS_DATA registers. This is used to ensure that both the internal sensor
 * data (i.e. from gyro and accel) and external sensor data have been loaded to
 * their respective data registers (i.e. the data is synced) when the Data Ready
 * interrupt is triggered.
 *
 * @return Current wait-for-external-sensor-data enabled value
 * @see MPU6500_RA_I2C_MST_CTRL
 */
bool mpu6500GetWaitForExternalSensorEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_CTRL, MPU6500_WAIT_FOR_ES_BIT, buffer);
  return buffer[0];
}
/** Set wait-for-external-sensor-data enabled value.
 * @param enabled New wait-for-external-sensor-data enabled value
 * @see getWaitForExternalSensorEnabled()
 * @see MPU6500_RA_I2C_MST_CTRL
 */
void mpu6500SetWaitForExternalSensorEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_I2C_MST_CTRL, MPU6500_WAIT_FOR_ES_BIT, enabled);
}
/** Get Slave 3 FIFO enabled value.
 * When set to 1, this bit enables EXT_SENS_DATA registers (Registers 73 to 96)
 * associated with Slave 3 to be written into the FIFO buffer.
 * @return Current Slave 3 FIFO enabled value
 * @see MPU6500_RA_MST_CTRL
 */
bool mpu6500GetSlave3FIFOEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_CTRL, MPU6500_SLV_3_FIFO_EN_BIT, buffer);
  return buffer[0];
}
/** Set Slave 3 FIFO enabled value.
 * @param enabled New Slave 3 FIFO enabled value
 * @see getSlave3FIFOEnabled()
 * @see MPU6500_RA_MST_CTRL
 */
void mpu6500SetSlave3FIFOEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_I2C_MST_CTRL, MPU6500_SLV_3_FIFO_EN_BIT, enabled);
}
/** Get slave read/write transition enabled value.
 * The I2C_MST_P_NSR bit configures the I2C Master's transition from one slave
 * read to the next slave read. If the bit equals 0, there will be a restart
 * between reads. If the bit equals 1, there will be a stop followed by a start
 * of the following read. When a write transaction follows a read transaction,
 * the stop followed by a start of the successive write will be always used.
 *
 * @return Current slave read/write transition enabled value
 * @see MPU6500_RA_I2C_MST_CTRL
 */
bool mpu6500GetSlaveReadWriteTransitionEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_CTRL, MPU6500_I2C_MST_P_NSR_BIT, buffer);
  return buffer[0];
}
/** Set slave read/write transition enabled value.
 * @param enabled New slave read/write transition enabled value
 * @see getSlaveReadWriteTransitionEnabled()
 * @see MPU6500_RA_I2C_MST_CTRL
 */
void mpu6500SetSlaveReadWriteTransitionEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_I2C_MST_CTRL, MPU6500_I2C_MST_P_NSR_BIT, enabled);
}
/** Get I2C master clock speed.
 * I2C_MST_CLK is a 4 bit unsigned value which configures a divider on the
 * MPU-60X0 internal 8MHz clock. It sets the I2C master clock speed according to
 * the following table:
 *
 * <pre>
 * I2C_MST_CLK | I2C Master Clock Speed | 8MHz Clock Divider
 * ------------+------------------------+-------------------
 * 0           | 348kHz                 | 23
 * 1           | 333kHz                 | 24
 * 2           | 320kHz                 | 25
 * 3           | 308kHz                 | 26
 * 4           | 296kHz                 | 27
 * 5           | 286kHz                 | 28
 * 6           | 276kHz                 | 29
 * 7           | 267kHz                 | 30
 * 8           | 258kHz                 | 31
 * 9           | 500kHz                 | 16
 * 10          | 471kHz                 | 17
 * 11          | 444kHz                 | 18
 * 12          | 421kHz                 | 19
 * 13          | 400kHz                 | 20
 * 14          | 381kHz                 | 21
 * 15          | 364kHz                 | 22
 * </pre>
 *
 * @return Current I2C master clock speed
 * @see MPU6500_RA_I2C_MST_CTRL
 */
uint8_t mpu6500GetMasterClockSpeed()
{
  i2cdev_readBits(devAddr, MPU6500_RA_I2C_MST_CTRL, MPU6500_I2C_MST_CLK_BIT,
      MPU6500_I2C_MST_CLK_LENGTH, buffer);
  return buffer[0];
}
/** Set I2C master clock speed.
 * @reparam speed Current I2C master clock speed
 * @see MPU6500_RA_I2C_MST_CTRL
 */
void mpu6500SetMasterClockSpeed(uint8_t speed)
{
  i2cdev_writeBits(devAddr, MPU6500_RA_I2C_MST_CTRL, MPU6500_I2C_MST_CLK_BIT,
      MPU6500_I2C_MST_CLK_LENGTH, speed);
}

