NordicPlayground/nrf52-quadcopter/Firmware/drivers/mpu6500.c
/** Get the I2C address of Slave 4.
 * Note that Bit 7 (MSB) controls read/write mode. If Bit 7 is set, it's a read
 * operation, and if it is cleared, then it's a write operation. The remaining
 * bits (6-0) are the 7-bit device address of the slave device.
 *
 * @return Current address for Slave 4
 * @see getSlaveAddress()
 * @see MPU6500_RA_I2C_SLV4_ADDR
 */
uint8_t mpu6500GetSlave4Address()
{
  i2cdev_readByte(devAddr, MPU6500_RA_I2C_SLV4_ADDR, buffer);
  return buffer[0];
}
/** Set the I2C address of Slave 4.
 * @param address New address for Slave 4
 * @see getSlave4Address()
 * @see MPU6500_RA_I2C_SLV4_ADDR
 */
void mpu6500SetSlave4Address(uint8_t address)
{
  i2cdev_writeByte(devAddr, MPU6500_RA_I2C_SLV4_ADDR, address);
}
/** Get the active internal register for the Slave 4.
 * Read/write operations for this slave will be done to whatever internal
 * register address is stored in this MPU register.
 *
 * @return Current active register for Slave 4
 * @see MPU6500_RA_I2C_SLV4_REG
 */
uint8_t mpu6500GetSlave4Register()
{
  i2cdev_readByte(devAddr, MPU6500_RA_I2C_SLV4_REG, buffer);
  return buffer[0];
}
/** Set the active internal register for Slave 4.
 * @param reg New active register for Slave 4
 * @see getSlave4Register()
 * @see MPU6500_RA_I2C_SLV4_REG
 */
void mpu6500SetSlave4Register(uint8_t reg)
{
  i2cdev_writeByte(devAddr, MPU6500_RA_I2C_SLV4_REG, reg);
}
/** Set new byte to write to Slave 4.
 * This register stores the data to be written into the Slave 4. If I2C_SLV4_RW
 * is set 1 (set to read), this register has no effect.
 * @param data New byte to write to Slave 4
 * @see MPU6500_RA_I2C_SLV4_DO
 */
void mpu6500SetSlave4OutputByte(uint8_t data)
{
  i2cdev_writeByte(devAddr, MPU6500_RA_I2C_SLV4_DO, data);
}
/** Get the enabled value for the Slave 4.
 * When set to 1, this bit enables Slave 4 for data transfer operations. When
 * cleared to 0, this bit disables Slave 4 from data transfer operations.
 * @return Current enabled value for Slave 4
 * @see MPU6500_RA_I2C_SLV4_CTRL
 */
bool mpu6500GetSlave4Enabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_SLV4_CTRL, MPU6500_I2C_SLV4_EN_BIT, buffer);
  return buffer[0];
}
/** Set the enabled value for Slave 4.
 * @param enabled New enabled value for Slave 4
 * @see getSlave4Enabled()
 * @see MPU6500_RA_I2C_SLV4_CTRL
 */
void mpu6500SetSlave4Enabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_I2C_SLV4_CTRL, MPU6500_I2C_SLV4_EN_BIT, enabled);
}
/** Get the enabled value for Slave 4 transaction interrupts.
 * When set to 1, this bit enables the generation of an interrupt signal upon
 * completion of a Slave 4 transaction. When cleared to 0, this bit disables the
 * generation of an interrupt signal upon completion of a Slave 4 transaction.
 * The interrupt status can be observed in Register 54.
 *
 * @return Current enabled value for Slave 4 transaction interrupts.
 * @see MPU6500_RA_I2C_SLV4_CTRL
 */
bool mpu6500GetSlave4InterruptEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_SLV4_CTRL, MPU6500_I2C_SLV4_INT_EN_BIT, buffer);
  return buffer[0];
}
/** Set the enabled value for Slave 4 transaction interrupts.
 * @param enabled New enabled value for Slave 4 transaction interrupts.
 * @see getSlave4InterruptEnabled()
 * @see MPU6500_RA_I2C_SLV4_CTRL
 */
void mpu6500SetSlave4InterruptEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_I2C_SLV4_CTRL, MPU6500_I2C_SLV4_INT_EN_BIT, enabled);
}
/** Get write mode for Slave 4.
 * When set to 1, the transaction will read or write data only. When cleared to
 * 0, the transaction will write a register address prior to reading or writing
 * data. This should equal 0 when specifying the register address within the
 * Slave device to/from which the ensuing data transaction will take place.
 *
 * @return Current write mode for Slave 4 (0 = register address + data, 1 = data only)
 * @see MPU6500_RA_I2C_SLV4_CTRL
 */
bool mpu6500GetSlave4WriteMode()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_SLV4_CTRL, MPU6500_I2C_SLV4_REG_DIS_BIT, buffer);
  return buffer[0];
}
/** Set write mode for the Slave 4.
 * @param mode New write mode for Slave 4 (0 = register address + data, 1 = data only)
 * @see getSlave4WriteMode()
 * @see MPU6500_RA_I2C_SLV4_CTRL
 */
void mpu6500SetSlave4WriteMode(bool mode)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_I2C_SLV4_CTRL, MPU6500_I2C_SLV4_REG_DIS_BIT, mode);
}
/** Get Slave 4 master delay value.
 * This configures the reduced access rate of I2C slaves relative to the Sample
 * Rate. When a slave's access rate is decreased relative to the Sample Rate,
 * the slave is accessed every:
 *
 *     1 / (1 + I2C_MST_DLY) samples
 *
 * This base Sample Rate in turn is determined by SMPLRT_DIV (register 25) and
 * DLPF_CFG (register 26). Whether a slave's access rate is reduced relative to
 * the Sample Rate is determined by I2C_MST_DELAY_CTRL (register 103). For
 * further information regarding the Sample Rate, please refer to register 25.
 *
 * @return Current Slave 4 master delay value
 * @see MPU6500_RA_I2C_SLV4_CTRL
 */
uint8_t mpu6500GetSlave4MasterDelay()
{
  i2cdev_readBits(devAddr, MPU6500_RA_I2C_SLV4_CTRL, MPU6500_I2C_SLV4_MST_DLY_BIT,
      MPU6500_I2C_SLV4_MST_DLY_LENGTH, buffer);
  return buffer[0];
}
/** Set Slave 4 master delay value.
 * @param delay New Slave 4 master delay value
 * @see getSlave4MasterDelay()
 * @see MPU6500_RA_I2C_SLV4_CTRL
 */
void mpu6500SetSlave4MasterDelay(uint8_t delay)
{
  i2cdev_writeBits(devAddr, MPU6500_RA_I2C_SLV4_CTRL, MPU6500_I2C_SLV4_MST_DLY_BIT,
      MPU6500_I2C_SLV4_MST_DLY_LENGTH, delay);
}
/** Get last available byte read from Slave 4.
 * This register stores the data read from Slave 4. This field is populated
 * after a read transaction.
 * @return Last available byte read from to Slave 4
 * @see MPU6500_RA_I2C_SLV4_DI
 */
uint8_t mpu6500GetSlate4InputByte()
{
  i2cdev_readByte(devAddr, MPU6500_RA_I2C_SLV4_DI, buffer);
  return buffer[0];
}

// I2C_MST_STATUS register

/** Get FSYNC interrupt status.
 * This bit reflects the status of the FSYNC interrupt from an external device
 * into the MPU-60X0. This is used as a way to pass an external interrupt
 * through the MPU-60X0 to the host application processor. When set to 1, this
 * bit will cause an interrupt if FSYNC_INT_EN is asserted in INT_PIN_CFG
 * (Register 55).
 * @return FSYNC interrupt status
 * @see MPU6500_RA_I2C_MST_STATUS
 */
bool mpu6500GetPassthroughStatus()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_STATUS, MPU6500_MST_PASS_THROUGH_BIT, buffer);
  return buffer[0];
}
/** Get Slave 4 transaction done status.
 * Automatically sets to 1 when a Slave 4 transaction has completed. This
 * triggers an interrupt if the I2C_MST_INT_EN bit in the INT_ENABLE register
 * (Register 56) is asserted and if the SLV_4_DONE_INT bit is asserted in the
 * I2C_SLV4_CTRL register (Register 52).
 * @return Slave 4 transaction done status
 * @see MPU6500_RA_I2C_MST_STATUS
 */
bool mpu6500GetSlave4IsDone()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_STATUS, MPU6500_MST_I2C_SLV4_DONE_BIT, buffer);
  return buffer[0];
}
/** Get master arbitration lost status.
 * This bit automatically sets to 1 when the I2C Master has lost arbitration of
 * the auxiliary I2C bus (an error condition). This triggers an interrupt if the
 * I2C_MST_INT_EN bit in the INT_ENABLE register (Register 56) is asserted.
 * @return Master arbitration lost status
 * @see MPU6500_RA_I2C_MST_STATUS
 */
bool mpu6500GetLostArbitration()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_STATUS, MPU6500_MST_I2C_LOST_ARB_BIT, buffer);
  return buffer[0];
}
/** Get Slave 4 NACK status.
 * This bit automatically sets to 1 when the I2C Master receives a NACK in a
 * transaction with Slave 4. This triggers an interrupt if the I2C_MST_INT_EN
 * bit in the INT_ENABLE register (Register 56) is asserted.
 * @return Slave 4 NACK interrupt status
 * @see MPU6500_RA_I2C_MST_STATUS
 */
bool mpu6500GetSlave4Nack()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_STATUS, MPU6500_MST_I2C_SLV4_NACK_BIT, buffer);
  return buffer[0];
}
/** Get Slave 3 NACK status.
 * This bit automatically sets to 1 when the I2C Master receives a NACK in a
 * transaction with Slave 3. This triggers an interrupt if the I2C_MST_INT_EN
 * bit in the INT_ENABLE register (Register 56) is asserted.
 * @return Slave 3 NACK interrupt status
 * @see MPU6500_RA_I2C_MST_STATUS
 */
bool mpu6500GetSlave3Nack()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_STATUS, MPU6500_MST_I2C_SLV3_NACK_BIT, buffer);
  return buffer[0];
}
/** Get Slave 2 NACK status.
 * This bit automatically sets to 1 when the I2C Master receives a NACK in a
 * transaction with Slave 2. This triggers an interrupt if the I2C_MST_INT_EN
 * bit in the INT_ENABLE register (Register 56) is asserted.
 * @return Slave 2 NACK interrupt status
 * @see MPU6500_RA_I2C_MST_STATUS
 */
bool mpu6500GetSlave2Nack()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_STATUS, MPU6500_MST_I2C_SLV2_NACK_BIT, buffer);
  return buffer[0];
}
/** Get Slave 1 NACK status.
 * This bit automatically sets to 1 when the I2C Master receives a NACK in a
 * transaction with Slave 1. This triggers an interrupt if the I2C_MST_INT_EN
 * bit in the INT_ENABLE register (Register 56) is asserted.
 * @return Slave 1 NACK interrupt status
 * @see MPU6500_RA_I2C_MST_STATUS
 */
bool mpu6500GetSlave1Nack()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_STATUS, MPU6500_MST_I2C_SLV1_NACK_BIT, buffer);
  return buffer[0];
}
/** Get Slave 0 NACK status.
 * This bit automatically sets to 1 when the I2C Master receives a NACK in a
 * transaction with Slave 0. This triggers an interrupt if the I2C_MST_INT_EN
 * bit in the INT_ENABLE register (Register 56) is asserted.
 * @return Slave 0 NACK interrupt status
 * @see MPU6500_RA_I2C_MST_STATUS
 */
bool mpu6500GetSlave0Nack()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_STATUS, MPU6500_MST_I2C_SLV0_NACK_BIT, buffer);
  return buffer[0];
}

// INT_PIN_CFG register

/** Get interrupt logic level mode.
 * Will be set 0 for active-high, 1 for active-low.
 * @return Current interrupt mode (0=active-high, 1=active-low)
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_INT_LEVEL_BIT
 */
bool mpu6500GetInterruptMode()
{
  i2cdev_readBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_INT_LEVEL_BIT, buffer);
  return buffer[0];
}
/** Set interrupt logic level mode.
 * @param mode New interrupt mode (0=active-high, 1=active-low)
 * @see getInterruptMode()
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_INT_LEVEL_BIT
 */
void mpu6500SetInterruptMode(bool mode)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_INT_LEVEL_BIT, mode);
}
/** Get interrupt drive mode.
 * Will be set 0 for push-pull, 1 for open-drain.
 * @return Current interrupt drive mode (0=push-pull, 1=open-drain)
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_INT_OPEN_BIT
 */
bool mpu6500GetInterruptDrive()
{
  i2cdev_readBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_INT_OPEN_BIT, buffer);
  return buffer[0];
}
/** Set interrupt drive mode.
 * @param drive New interrupt drive mode (0=push-pull, 1=open-drain)
 * @see getInterruptDrive()
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_INT_OPEN_BIT
 */
void mpu6500SetInterruptDrive(bool drive)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_INT_OPEN_BIT, drive);
}
/** Get interrupt latch mode.
 * Will be set 0 for 50us-pulse, 1 for latch-until-int-cleared.
 * @return Current latch mode (0=50us-pulse, 1=latch-until-int-cleared)
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_LATCH_INT_EN_BIT
 */
bool mpu6500GetInterruptLatch()
{
  i2cdev_readBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_LATCH_INT_EN_BIT, buffer);
  return buffer[0];
}
/** Set interrupt latch mode.
 * @param latch New latch mode (0=50us-pulse, 1=latch-until-int-cleared)
 * @see getInterruptLatch()
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_LATCH_INT_EN_BIT
 */
void mpu6500SetInterruptLatch(bool latch)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_LATCH_INT_EN_BIT, latch);
}
/** Get interrupt latch clear mode.
 * Will be set 0 for status-read-only, 1 for any-register-read.
 * @return Current latch clear mode (0=status-read-only, 1=any-register-read)
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_INT_RD_CLEAR_BIT
 */
bool mpu6500GetInterruptLatchClear()
{
  i2cdev_readBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_INT_RD_CLEAR_BIT, buffer);
  return buffer[0];
}
/** Set interrupt latch clear mode.
 * @param clear New latch clear mode (0=status-read-only, 1=any-register-read)
 * @see getInterruptLatchClear()
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_INT_RD_CLEAR_BIT
 */
void mpu6500SetInterruptLatchClear(bool clear)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_INT_RD_CLEAR_BIT, clear);
}
/** Get FSYNC interrupt logic level mode.
 * @return Current FSYNC interrupt mode (0=active-high, 1=active-low)
 * @see getFSyncInterruptMode()
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_FSYNC_INT_LEVEL_BIT
 */
bool mpu6500GetFSyncInterruptLevel()
{
  i2cdev_readBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_FSYNC_INT_LEVEL_BIT, buffer);
  return buffer[0];
}
/** Set FSYNC interrupt logic level mode.
 * @param mode New FSYNC interrupt mode (0=active-high, 1=active-low)
 * @see getFSyncInterruptMode()
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_FSYNC_INT_LEVEL_BIT
 */
void mpu6500SetFSyncInterruptLevel(bool level)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_FSYNC_INT_LEVEL_BIT, level);
}
/** Get FSYNC pin interrupt enabled setting.
 * Will be set 0 for disabled, 1 for enabled.
 * @return Current interrupt enabled setting
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_FSYNC_INT_EN_BIT
 */
bool mpu6500GetFSyncInterruptEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_FSYNC_INT_EN_BIT, buffer);
  return buffer[0];
}
/** Set FSYNC pin interrupt enabled setting.
 * @param enabled New FSYNC pin interrupt enabled setting
 * @see getFSyncInterruptEnabled()
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_FSYNC_INT_EN_BIT
 */
void mpu6500SetFSyncInterruptEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_FSYNC_INT_EN_BIT, enabled);
}
/** Get I2C bypass enabled status.
 * When this bit is equal to 1 and I2C_MST_EN (Register 106 bit[5]) is equal to
 * 0, the host application processor will be able to directly access the
 * auxiliary I2C bus of the MPU-60X0. When this bit is equal to 0, the host
 * application processor will not be able to directly access the auxiliary I2C
 * bus of the MPU-60X0 regardless of the state of I2C_MST_EN (Register 106
 * bit[5]).
 * @return Current I2C bypass enabled status
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_I2C_BYPASS_EN_BIT
 */
bool mpu6500GetI2CBypassEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_I2C_BYPASS_EN_BIT, buffer);
  return buffer[0];
}
/** Set I2C bypass enabled status.
 * When this bit is equal to 1 and I2C_MST_EN (Register 106 bit[5]) is equal to
 * 0, the host application processor will be able to directly access the
 * auxiliary I2C bus of the MPU-60X0. When this bit is equal to 0, the host
 * application processor will not be able to directly access the auxiliary I2C
 * bus of the MPU-60X0 regardless of the state of I2C_MST_EN (Register 106
 * bit[5]).
 * @param enabled New I2C bypass enabled status
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_I2C_BYPASS_EN_BIT
 */
void mpu6500SetI2CBypassEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_I2C_BYPASS_EN_BIT, enabled);
}
/** Get reference clock output enabled status.
 * When this bit is equal to 1, a reference clock output is provided at the
 * CLKOUT pin. When this bit is equal to 0, the clock output is disabled. For
 * further information regarding CLKOUT, please refer to the MPU-60X0 Product
 * Specification document.
 * @return Current reference clock output enabled status
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_CLKOUT_EN_BIT
 */
bool mpu6500GetClockOutputEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_CLKOUT_EN_BIT, buffer);
  return buffer[0];
}
/** Set reference clock output enabled status.
 * When this bit is equal to 1, a reference clock output is provided at the
 * CLKOUT pin. When this bit is equal to 0, the clock output is disabled. For
 * further information regarding CLKOUT, please refer to the MPU-60X0 Product
 * Specification document.
 * @param enabled New reference clock output enabled status
 * @see MPU6500_RA_INT_PIN_CFG
 * @see MPU6500_INTCFG_CLKOUT_EN_BIT
 */
void mpu6500SetClockOutputEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_INT_PIN_CFG, MPU6500_INTCFG_CLKOUT_EN_BIT, enabled);
}

// INT_ENABLE register

