NordicPlayground/nrf52-quadcopter/Firmware/drivers/mpu6500.c
/** Get X-axis negative motion detection interrupt status.
 * @return Motion detection status
 * @see MPU6500_RA_MOT_DETECT_STATUS
 * @see MPU6500_MOTION_MOT_XNEG_BIT
 */
bool mpu6500GetXNegMotionDetected()
{
  i2cdev_readBit(devAddr, MPU6500_RA_MOT_DETECT_STATUS, MPU6500_MOTION_MOT_XNEG_BIT, buffer);
  return buffer[0];
}
/** Get X-axis positive motion detection interrupt status.
 * @return Motion detection status
 * @see MPU6500_RA_MOT_DETECT_STATUS
 * @see MPU6500_MOTION_MOT_XPOS_BIT
 */
bool mpu6500GetXPosMotionDetected()
{
  i2cdev_readBit(devAddr, MPU6500_RA_MOT_DETECT_STATUS, MPU6500_MOTION_MOT_XPOS_BIT, buffer);
  return buffer[0];
}
/** Get Y-axis negative motion detection interrupt status.
 * @return Motion detection status
 * @see MPU6500_RA_MOT_DETECT_STATUS
 * @see MPU6500_MOTION_MOT_YNEG_BIT
 */
bool mpu6500GetYNegMotionDetected()
{
  i2cdev_readBit(devAddr, MPU6500_RA_MOT_DETECT_STATUS, MPU6500_MOTION_MOT_YNEG_BIT, buffer);
  return buffer[0];
}
/** Get Y-axis positive motion detection interrupt status.
 * @return Motion detection status
 * @see MPU6500_RA_MOT_DETECT_STATUS
 * @see MPU6500_MOTION_MOT_YPOS_BIT
 */
bool mpu6500GetYPosMotionDetected()
{
  i2cdev_readBit(devAddr, MPU6500_RA_MOT_DETECT_STATUS, MPU6500_MOTION_MOT_YPOS_BIT, buffer);
  return buffer[0];
}
/** Get Z-axis negative motion detection interrupt status.
 * @return Motion detection status
 * @see MPU6500_RA_MOT_DETECT_STATUS
 * @see MPU6500_MOTION_MOT_ZNEG_BIT
 */
bool mpu6500GetZNegMotionDetected()
{
  i2cdev_readBit(devAddr, MPU6500_RA_MOT_DETECT_STATUS, MPU6500_MOTION_MOT_ZNEG_BIT, buffer);
  return buffer[0];
}
/** Get Z-axis positive motion detection interrupt status.
 * @return Motion detection status
 * @see MPU6500_RA_MOT_DETECT_STATUS
 * @see MPU6500_MOTION_MOT_ZPOS_BIT
 */
bool mpu6500GetZPosMotionDetected()
{
  i2cdev_readBit(devAddr, MPU6500_RA_MOT_DETECT_STATUS, MPU6500_MOTION_MOT_ZPOS_BIT, buffer);
  return buffer[0];
}
/** Get zero motion detection interrupt status.
 * @return Motion detection status
 * @see MPU6500_RA_MOT_DETECT_STATUS
 * @see MPU6500_MOTION_MOT_ZRMOT_BIT
 */
bool mpu6500GetZeroMotionDetected()
{
  i2cdev_readBit(devAddr, MPU6500_RA_MOT_DETECT_STATUS, MPU6500_MOTION_MOT_ZRMOT_BIT, buffer);
  return buffer[0];
}

// I2C_SLV*_DO register

/** Write byte to Data Output container for specified slave.
 * This register holds the output data written into Slave when Slave is set to
 * write mode. For further information regarding Slave control, please
 * refer to Registers 37 to 39 and immediately following.
 * @param num Slave number (0-3)
 * @param data Byte to write
 * @see MPU6500_RA_I2C_SLV0_DO
 */
void mpu6500SetSlaveOutputByte(uint8_t num, uint8_t data)
{
  if (num > 3)
    return;
  i2cdev_writeByte(devAddr, MPU6500_RA_I2C_SLV0_DO + num, data);
}

// I2C_MST_DELAY_CTRL register

/** Get external data shadow delay enabled status.
 * This register is used to specify the timing of external sensor data
 * shadowing. When DELAY_ES_SHADOW is set to 1, shadowing of external
 * sensor data is delayed until all data has been received.
 * @return Current external data shadow delay enabled status.
 * @see MPU6500_RA_I2C_MST_DELAY_CTRL
 * @see MPU6500_DELAYCTRL_DELAY_ES_SHADOW_BIT
 */
bool mpu6500GetExternalShadowDelayEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_DELAY_CTRL, MPU6500_DELAYCTRL_DELAY_ES_SHADOW_BIT,
      buffer);
  return buffer[0];
}
/** Set external data shadow delay enabled status.
 * @param enabled New external data shadow delay enabled status.
 * @see getExternalShadowDelayEnabled()
 * @see MPU6500_RA_I2C_MST_DELAY_CTRL
 * @see MPU6500_DELAYCTRL_DELAY_ES_SHADOW_BIT
 */
void mpu6500SetExternalShadowDelayEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_I2C_MST_DELAY_CTRL,
      MPU6500_DELAYCTRL_DELAY_ES_SHADOW_BIT, enabled);
}
/** Get slave delay enabled status.
 * When a particular slave delay is enabled, the rate of access for the that
 * slave device is reduced. When a slave's access rate is decreased relative to
 * the Sample Rate, the slave is accessed every:
 *
 *     1 / (1 + I2C_MST_DLY) Samples
 *
 * This base Sample Rate in turn is determined by SMPLRT_DIV (register  * 25)
 * and DLPF_CFG (register 26).
 *
 * For further information regarding I2C_MST_DLY, please refer to register 52.
 * For further information regarding the Sample Rate, please refer to register 25.
 *
 * @param num Slave number (0-4)
 * @return Current slave delay enabled status.
 * @see MPU6500_RA_I2C_MST_DELAY_CTRL
 * @see MPU6500_DELAYCTRL_I2C_SLV0_DLY_EN_BIT
 */
bool mpu6500GetSlaveDelayEnabled(uint8_t num)
{
  // MPU6500_DELAYCTRL_I2C_SLV4_DLY_EN_BIT is 4, SLV3 is 3, etc.
  if (num > 4)
    return 0;
  i2cdev_readBit(devAddr, MPU6500_RA_I2C_MST_DELAY_CTRL, num, buffer);
  return buffer[0];
}
/** Set slave delay enabled status.
 * @param num Slave number (0-4)
 * @param enabled New slave delay enabled status.
 * @see MPU6500_RA_I2C_MST_DELAY_CTRL
 * @see MPU6500_DELAYCTRL_I2C_SLV0_DLY_EN_BIT
 */
void mpu6500SetSlaveDelayEnabled(uint8_t num, bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_I2C_MST_DELAY_CTRL, num, enabled);
}

// SIGNAL_PATH_RESET register

/** Reset gyroscope signal path.
 * The reset will revert the signal path analog to digital converters and
 * filters to their power up configurations.
 * @see MPU6500_RA_SIGNAL_PATH_RESET
 * @see MPU6500_PATHRESET_GYRO_RESET_BIT
 */
void mpu6500ResetGyroscopePath()
{
  i2cdev_writeBit(devAddr, MPU6500_RA_SIGNAL_PATH_RESET, MPU6500_PATHRESET_GYRO_RESET_BIT, 1);
}
/** Reset accelerometer signal path.
 * The reset will revert the signal path analog to digital converters and
 * filters to their power up configurations.
 * @see MPU6500_RA_SIGNAL_PATH_RESET
 * @see MPU6500_PATHRESET_ACCEL_RESET_BIT
 */
void mpu6500ResetAccelerometerPath()
{
  i2cdev_writeBit(devAddr, MPU6500_RA_SIGNAL_PATH_RESET, MPU6500_PATHRESET_ACCEL_RESET_BIT, 1);
}
/** Reset temperature sensor signal path.
 * The reset will revert the signal path analog to digital converters and
 * filters to their power up configurations.
 * @see MPU6500_RA_SIGNAL_PATH_RESET
 * @see MPU6500_PATHRESET_TEMP_RESET_BIT
 */
void mpu6500ResetTemperaturePath()
{
  i2cdev_writeBit(devAddr, MPU6500_RA_SIGNAL_PATH_RESET, MPU6500_PATHRESET_TEMP_RESET_BIT, 1);
}

// MOT_DETECT_CTRL register

