NordicPlayground/nrf52-quadcopter/Firmware/drivers/mpu6500.c
// PWR_MGMT_1 register

/** Trigger a full device reset.
 * A small delay of ~50ms may be desirable after triggering a reset.
 * @see MPU6500_RA_PWR_MGMT_1
 * @see MPU6500_PWR1_DEVICE_RESET_BIT
 */
void mpu6500Reset()
{
  i2cdev_writeBit(devAddr, MPU6500_RA_PWR_MGMT_1, MPU6500_PWR1_DEVICE_RESET_BIT, 1);
}
/** Get sleep mode status.
 * Setting the SLEEP bit in the register puts the device into very low power
 * sleep mode. In this mode, only the serial interface and internal registers
 * remain active, allowing for a very low standby current. Clearing this bit
 * puts the device back into normal mode. To save power, the individual standby
 * selections for each of the gyros should be used if any gyro axis is not used
 * by the application.
 * @return Current sleep mode enabled status
 * @see MPU6500_RA_PWR_MGMT_1
 * @see MPU6500_PWR1_SLEEP_BIT
 */
bool mpu6500GetSleepEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_PWR_MGMT_1, MPU6500_PWR1_SLEEP_BIT, buffer);
  return buffer[0];
}
/** Set sleep mode status.
 * @param enabled New sleep mode enabled status
 * @see getSleepEnabled()
 * @see MPU6500_RA_PWR_MGMT_1
 * @see MPU6500_PWR1_SLEEP_BIT
 */
void mpu6500SetSleepEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_PWR_MGMT_1, MPU6500_PWR1_SLEEP_BIT, enabled);
}
/** Get wake cycle enabled status.
 * When this bit is set to 1 and SLEEP is disabled, the MPU-60X0 will cycle
 * between sleep mode and waking up to take a single sample of data from active
 * sensors at a rate determined by LP_WAKE_CTRL (register 108).
 * @return Current sleep mode enabled status
 * @see MPU6500_RA_PWR_MGMT_1
 * @see MPU6500_PWR1_CYCLE_BIT
 */
bool mpu6500GetWakeCycleEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_PWR_MGMT_1, MPU6500_PWR1_CYCLE_BIT, buffer);
  return buffer[0];
}
/** Set wake cycle enabled status.
 * @param enabled New sleep mode enabled status
 * @see getWakeCycleEnabled()
 * @see MPU6500_RA_PWR_MGMT_1
 * @see MPU6500_PWR1_CYCLE_BIT
 */
void mpu6500SetWakeCycleEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_PWR_MGMT_1, MPU6500_PWR1_CYCLE_BIT, enabled);
}
/** Get temperature sensor enabled status.
 * Control the usage of the internal temperature sensor.
 *
 * Note: this register stores the *disabled* value, but for consistency with the
 * rest of the code, the function is named and used with standard true/false
 * values to indicate whether the sensor is enabled or disabled, respectively.
 *
 * @return Current temperature sensor enabled status
 * @see MPU6500_RA_PWR_MGMT_1
 * @see MPU6500_PWR1_TEMP_DIS_BIT
 */
bool mpu6500GetTempSensorEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_PWR_MGMT_1, MPU6500_PWR1_TEMP_DIS_BIT, buffer);
  return buffer[0] == 0; // 1 is actually disabled here
}
/** Set temperature sensor enabled status.
 * Note: this register stores the *disabled* value, but for consistency with the
 * rest of the code, the function is named and used with standard true/false
 * values to indicate whether the sensor is enabled or disabled, respectively.
 *
 * @param enabled New temperature sensor enabled status
 * @see getTempSensorEnabled()
 * @see MPU6500_RA_PWR_MGMT_1
 * @see MPU6500_PWR1_TEMP_DIS_BIT
 */
void mpu6500SetTempSensorEnabled(bool enabled)
{
  // 1 is actually disabled here
  i2cdev_writeBit(devAddr, MPU6500_RA_PWR_MGMT_1, MPU6500_PWR1_TEMP_DIS_BIT, !enabled);
}
/** Get clock source setting.
 * @return Current clock source setting
 * @see MPU6500_RA_PWR_MGMT_1
 * @see MPU6500_PWR1_CLKSEL_BIT
 * @see MPU6500_PWR1_CLKSEL_LENGTH
 */
uint8_t mpu6500GetClockSource()
{
  i2cdev_readBits(devAddr, MPU6500_RA_PWR_MGMT_1, MPU6500_PWR1_CLKSEL_BIT,
      MPU6500_PWR1_CLKSEL_LENGTH, buffer);
  return buffer[0];
}
/** Set clock source setting.
 * An internal 8MHz oscillator, gyroscope based clock, or external sources can
 * be selected as the MPU-60X0 clock source. When the internal 8 MHz oscillator
 * or an external source is chosen as the clock source, the MPU-60X0 can operate
 * in low power modes with the gyroscopes disabled.
 *
 * Upon power up, the MPU-60X0 clock source defaults to the internal oscillator.
 * However, it is highly recommended that the device be configured to use one of
 * the gyroscopes (or an external clock source) as the clock reference for
 * improved stability. The clock source can be selected according to the following table:
 *
 * <pre>
 * CLK_SEL | Clock Source
 * --------+--------------------------------------
 * 0       | Internal oscillator
 * 1       | PLL with X Gyro reference
 * 2       | PLL with Y Gyro reference
 * 3       | PLL with Z Gyro reference
 * 4       | PLL with external 32.768kHz reference
 * 5       | PLL with external 19.2MHz reference
 * 6       | Reserved
 * 7       | Stops the clock and keeps the timing generator in reset
 * </pre>
 *
 * @param source New clock source setting
 * @see getClockSource()
 * @see MPU6500_RA_PWR_MGMT_1
 * @see MPU6500_PWR1_CLKSEL_BIT
 * @see MPU6500_PWR1_CLKSEL_LENGTH
 */
void mpu6500SetClockSource(uint8_t source)
{
  i2cdev_writeBits(devAddr, MPU6500_RA_PWR_MGMT_1, MPU6500_PWR1_CLKSEL_BIT,
      MPU6500_PWR1_CLKSEL_LENGTH, source);
}

// PWR_MGMT_2 register

/** Get wake frequency in Accel-Only Low Power Mode.
 * The MPU-60X0 can be put into Accerlerometer Only Low Power Mode by setting
 * PWRSEL to 1 in the Power Management 1 register (Register 107). In this mode,
 * the device will power off all devices except for the primary I2C interface,
 * waking only the accelerometer at fixed intervals to take a single
 * measurement. The frequency of wake-ups can be configured with LP_WAKE_CTRL
 * as shown below:
 *
 * <pre>
 * LP_WAKE_CTRL | Wake-up Frequency
 * -------------+------------------
 * 0            | 1.25 Hz
 * 1            | 2.5 Hz
 * 2            | 5 Hz
 * 3            | 10 Hz
 * <pre>
 *
 * For further information regarding the MPU-60X0's power modes, please refer to
 * Register 107.
 *
 * @return Current wake frequency
 * @see MPU6500_RA_PWR_MGMT_2
 */
uint8_t mpu6500GetWakeFrequency()
{
  i2cdev_readBits(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_LP_WAKE_CTRL_BIT,
      MPU6500_PWR2_LP_WAKE_CTRL_LENGTH, buffer);
  return buffer[0];
}
/** Set wake frequency in Accel-Only Low Power Mode.
 * @param frequency New wake frequency
 * @see MPU6500_RA_PWR_MGMT_2
 */
void mpu6500SetWakeFrequency(uint8_t frequency)
{
  i2cdev_writeBits(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_LP_WAKE_CTRL_BIT,
      MPU6500_PWR2_LP_WAKE_CTRL_LENGTH, frequency);
}

/** Get X-axis accelerometer standby enabled status.
 * If enabled, the X-axis will not gather or report data (or use power).
 * @return Current X-axis standby enabled status
 * @see MPU6500_RA_PWR_MGMT_2
 * @see MPU6500_PWR2_STBY_XA_BIT
 */
bool mpu6500GetStandbyXAccelEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_STBY_XA_BIT, buffer);
  return buffer[0];
}
/** Set X-axis accelerometer standby enabled status.
 * @param New X-axis standby enabled status
 * @see getStandbyXAccelEnabled()
 * @see MPU6500_RA_PWR_MGMT_2
 * @see MPU6500_PWR2_STBY_XA_BIT
 */
void mpu6500SetStandbyXAccelEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_STBY_XA_BIT, enabled);
}
/** Get Y-axis accelerometer standby enabled status.
 * If enabled, the Y-axis will not gather or report data (or use power).
 * @return Current Y-axis standby enabled status
 * @see MPU6500_RA_PWR_MGMT_2
 * @see MPU6500_PWR2_STBY_YA_BIT
 */
bool mpu6500GetStandbyYAccelEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_STBY_YA_BIT, buffer);
  return buffer[0];
}
/** Set Y-axis accelerometer standby enabled status.
 * @param New Y-axis standby enabled status
 * @see getStandbyYAccelEnabled()
 * @see MPU6500_RA_PWR_MGMT_2
 * @see MPU6500_PWR2_STBY_YA_BIT
 */
void mpu6500SetStandbyYAccelEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_STBY_YA_BIT, enabled);
}
/** Get Z-axis accelerometer standby enabled status.
 * If enabled, the Z-axis will not gather or report data (or use power).
 * @return Current Z-axis standby enabled status
 * @see MPU6500_RA_PWR_MGMT_2
 * @see MPU6500_PWR2_STBY_ZA_BIT
 */
bool mpu6500GetStandbyZAccelEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_STBY_ZA_BIT, buffer);
  return buffer[0];
}
/** Set Z-axis accelerometer standby enabled status.
 * @param New Z-axis standby enabled status
 * @see getStandbyZAccelEnabled()
 * @see MPU6500_RA_PWR_MGMT_2
 * @see MPU6500_PWR2_STBY_ZA_BIT
 */
void mpu6500SetStandbyZAccelEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_STBY_ZA_BIT, enabled);
}
/** Get X-axis gyroscope standby enabled status.
 * If enabled, the X-axis will not gather or report data (or use power).
 * @return Current X-axis standby enabled status
 * @see MPU6500_RA_PWR_MGMT_2
 * @see MPU6500_PWR2_STBY_XG_BIT
 */
bool mpu6500GetStandbyXGyroEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_STBY_XG_BIT, buffer);
  return buffer[0];
}
/** Set X-axis gyroscope standby enabled status.
 * @param New X-axis standby enabled status
 * @see getStandbyXGyroEnabled()
 * @see MPU6500_RA_PWR_MGMT_2
 * @see MPU6500_PWR2_STBY_XG_BIT
 */
void mpu6500SetStandbyXGyroEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_STBY_XG_BIT, enabled);
}
/** Get Y-axis gyroscope standby enabled status.
 * If enabled, the Y-axis will not gather or report data (or use power).
 * @return Current Y-axis standby enabled status
 * @see MPU6500_RA_PWR_MGMT_2
 * @see MPU6500_PWR2_STBY_YG_BIT
 */
bool mpu6500GetStandbyYGyroEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_STBY_YG_BIT, buffer);
  return buffer[0];
}
/** Set Y-axis gyroscope standby enabled status.
 * @param New Y-axis standby enabled status
 * @see getStandbyYGyroEnabled()
 * @see MPU6500_RA_PWR_MGMT_2
 * @see MPU6500_PWR2_STBY_YG_BIT
 */
void mpu6500SetStandbyYGyroEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_STBY_YG_BIT, enabled);
}
/** Get Z-axis gyroscope standby enabled status.
 * If enabled, the Z-axis will not gather or report data (or use power).
 * @return Current Z-axis standby enabled status
 * @see MPU6500_RA_PWR_MGMT_2
 * @see MPU6500_PWR2_STBY_ZG_BIT
 */
bool mpu6500GetStandbyZGyroEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_STBY_ZG_BIT, buffer);
  return buffer[0];
}
/** Set Z-axis gyroscope standby enabled status.
 * @param New Z-axis standby enabled status
 * @see getStandbyZGyroEnabled()
 * @see MPU6500_RA_PWR_MGMT_2
 * @see MPU6500_PWR2_STBY_ZG_BIT
 */
void mpu6500SetStandbyZGyroEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_PWR_MGMT_2, MPU6500_PWR2_STBY_ZG_BIT, enabled);
}

// FIFO_COUNT* registers

/** Get current FIFO buffer size.
 * This value indicates the number of bytes stored in the FIFO buffer. This
 * number is in turn the number of bytes that can be read from the FIFO buffer
 * and it is directly proportional to the number of samples available given the
 * set of sensor data bound to be stored in the FIFO (register 35 and 36).
 * @return Current FIFO buffer size
 */
uint16_t mpu6500GetFIFOCount()
{
  i2cdev_readBytes(devAddr, MPU6500_RA_FIFO_COUNTH, 2, buffer);
  return (((uint16_t) buffer[0]) << 8) | buffer[1];
}

// FIFO_R_W register

/** Get byte from FIFO buffer.
 * This register is used to read and write data from the FIFO buffer. Data is
 * written to the FIFO in order of register number (from lowest to highest). If
 * all the FIFO enable flags (see below) are enabled and all External Sensor
 * Data registers (Registers 73 to 96) are associated with a Slave device, the
 * contents of registers 59 through 96 will be written in order at the Sample
 * Rate.
 *
 * The contents of the sensor data registers (Registers 59 to 96) are written
 * into the FIFO buffer when their corresponding FIFO enable flags are set to 1
 * in FIFO_EN (Register 35). An additional flag for the sensor data registers
 * associated with I2C Slave 3 can be found in I2C_MST_CTRL (Register 36).
 *
 * If the FIFO buffer has overflowed, the status bit FIFO_OFLOW_INT is
 * automatically set to 1. This bit is located in INT_STATUS (Register 58).
 * When the FIFO buffer has overflowed, the oldest data will be lost and new
 * data will be written to the FIFO.
 *
 * If the FIFO buffer is empty, reading this register will return the last byte
 * that was previously read from the FIFO until new data is available. The user
 * should check FIFO_COUNT to ensure that the FIFO buffer is not read when
 * empty.
 *
 * @return Byte from FIFO buffer
 */
uint8_t mpu6500GetFIFOByte()
{
  i2cdev_readByte(devAddr, MPU6500_RA_FIFO_R_W, buffer);
  return buffer[0];
}
void mpu6500GetFIFOBytes(uint8_t *data, uint8_t length)
{
  i2cdev_readBytes(devAddr, MPU6500_RA_FIFO_R_W, length, data);
}
/** Write byte to FIFO buffer.
 * @see getFIFOByte()
 * @see MPU6500_RA_FIFO_R_W
 */
void mpu6500SetFIFOByte(uint8_t data)
{
  i2cdev_writeByte(devAddr, MPU6500_RA_FIFO_R_W, data);
}

// WHO_AM_I register

/** Get Device ID.
 * This register is used to verify the identity of the device (0b110100).
 * @return Device ID (should be 0x68, 104 dec, 150 oct)
 * @see MPU6500_RA_WHO_AM_I
 * @see MPU6500_WHO_AM_I_BIT
 * @see MPU6500_WHO_AM_I_LENGTH
 */
uint8_t mpu6500GetDeviceID()
{
  i2cdev_readBits(devAddr, MPU6500_RA_WHO_AM_I, MPU6500_WHO_AM_I_BIT, MPU6500_WHO_AM_I_LENGTH,
      buffer);
  return buffer[0];
}
/** Set Device ID.
 * Write a new ID into the WHO_AM_I register (no idea why this should ever be
 * necessary though).
 * @param id New device ID to set.
 * @see getDeviceID()
 * @see MPU6500_RA_WHO_AM_I
 * @see MPU6500_WHO_AM_I_BIT
 * @see MPU6500_WHO_AM_I_LENGTH
 */
void mpu6500SetDeviceID(uint8_t id)
{
  i2cdev_writeBits(devAddr, MPU6500_RA_WHO_AM_I, MPU6500_WHO_AM_I_BIT, MPU6500_WHO_AM_I_LENGTH,
      id);
}

// ======== UNDOCUMENTED/DMP REGISTERS/METHODS ========

// XG_OFFS_USR* registers
int16_t mpu6500GetXGyroOffsetUser(void) {
		uint8_t data[2];
    i2cdev_readBytes(devAddr, MPU6500_RA_XG_OFFS_USRL, 2, data);
    return ((data[1] << 8) | data[0]);
}
void mpu6500SetXGyroOffsetUser(int16_t offset) {
    uint8_t data[2];
		data[0] = (uint8_t)offset;
		data[1] = (uint8_t)(offset >> 8);
		i2cdev_writeBytes(devAddr, MPU6500_RA_XG_OFFS_USRL, 2, data);
}

// YG_OFFS_USR* register
int16_t mpu6500GetYGyroOffsetUser(void) {
    uint8_t data[2];
    i2cdev_readBytes(devAddr, MPU6500_RA_YG_OFFS_USRL, 2, data);
    return ((data[1] << 8) | data[0]);
}
void mpu6500SetYGyroOffsetUser(int16_t offset) {
    uint8_t data[2];
		data[0] = (uint8_t)offset;
		data[1] = (uint8_t)(offset >> 8);
		i2cdev_writeBytes(devAddr, MPU6500_RA_YG_OFFS_USRL, 2, data);
}

// ZG_OFFS_USR* register
int16_t mpu6500GetZGyroOffsetUser(void) {
    uint8_t data[2];
    i2cdev_readBytes(devAddr, MPU6500_RA_ZG_OFFS_USRL, 2, data);
    return ((data[1] << 8) | data[0]);
}
void mpu6500SetZGyroOffsetUser(int16_t offset) {
    uint8_t data[2];
		data[0] = (uint8_t)offset;
		data[1] = (uint8_t)(offset >> 8);
		i2cdev_writeBytes(devAddr, MPU6500_RA_ZG_OFFS_USRL, 2, data);
}

// XA_OFFS_* registers
int16_t mpu6500GetXAccelOffset(void) {
		uint8_t data[2];
    i2cdev_readBytes(devAddr, MPU6500_RA_XA_OFFSET_L, 2, data);
    return ((data[1] << 8) | data[0]);
}
void mpu6500SetXAccelOffset(int16_t offset) {
		uint8_t data[2];
		data[0] = (uint8_t)offset;
		data[1] = (uint8_t)(offset >> 8);
		i2cdev_writeBytes(devAddr, MPU6500_RA_XA_OFFSET_L, 2, data);
}

// YA_OFFS_* register
int16_t mpu6500GetYAccelOffset(void) {
		uint8_t data[2];
    i2cdev_readBytes(devAddr, MPU6500_RA_YA_OFFSET_L, 2, data);
    return ((data[1] << 8) | data[0]);
}
void mpu6500SetYAccelOffset(int16_t offset) {
		uint8_t data[2];
		data[0] = (uint8_t)offset;
		data[1] = (uint8_t)(offset >> 8);
		i2cdev_writeBytes(devAddr, MPU6500_RA_YA_OFFSET_L, 2, data);
}

// ZA_OFFS_* register
int16_t mpu6500GetZAccelOffset(void) {
		uint8_t data[2];
    i2cdev_readBytes(devAddr, MPU6500_RA_ZA_OFFSET_L, 2, data);
    return ((data[1] << 8) | data[0]);
}
void mpu6500SetZAccelOffset(int16_t offset) {
		uint8_t data[2];
		data[0] = (uint8_t)offset;
		data[1] = (uint8_t)(offset >> 8);
		i2cdev_writeBytes(devAddr, MPU6500_RA_ZA_OFFSET_L, 2, data);
}

