NordicPlayground/nrf52-quadcopter/Firmware/drivers/mpu6500.c
// INT_ENABLE register (DMP functions)

bool mpu6500GetIntPLLReadyEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_INT_ENABLE, MPU6500_INTERRUPT_PLL_RDY_INT_BIT, buffer);
  return buffer[0];
}
void mpu6500SetIntPLLReadyEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_INT_ENABLE, MPU6500_INTERRUPT_PLL_RDY_INT_BIT, enabled);
}
bool mpu6500GetIntDMPEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_INT_ENABLE, MPU6500_INTERRUPT_DMP_INT_BIT, buffer);
  return buffer[0];
}
void mpu6500SetIntDMPEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_INT_ENABLE, MPU6500_INTERRUPT_DMP_INT_BIT, enabled);
}

// DMP_INT_STATUS

bool mpu6500GetDMPInt5Status()
{
  i2cdev_readBit(devAddr, MPU6500_RA_DMP_INT_STATUS, MPU6500_DMPINT_5_BIT, buffer);
  return buffer[0];
}
bool mpu6500GetDMPInt4Status()
{
  i2cdev_readBit(devAddr, MPU6500_RA_DMP_INT_STATUS, MPU6500_DMPINT_4_BIT, buffer);
  return buffer[0];
}
bool mpu6500GetDMPInt3Status()
{
  i2cdev_readBit(devAddr, MPU6500_RA_DMP_INT_STATUS, MPU6500_DMPINT_3_BIT, buffer);
  return buffer[0];
}
bool mpu6500GetDMPInt2Status()
{
  i2cdev_readBit(devAddr, MPU6500_RA_DMP_INT_STATUS, MPU6500_DMPINT_2_BIT, buffer);
  return buffer[0];
}
bool mpu6500GetDMPInt1Status()
{
  i2cdev_readBit(devAddr, MPU6500_RA_DMP_INT_STATUS, MPU6500_DMPINT_1_BIT, buffer);
  return buffer[0];
}
bool mpu6500GetDMPInt0Status()
{
  i2cdev_readBit(devAddr, MPU6500_RA_DMP_INT_STATUS, MPU6500_DMPINT_0_BIT, buffer);
  return buffer[0];
}

// INT_STATUS register (DMP functions)

bool mpu6500GetIntPLLReadyStatus()
{
  i2cdev_readBit(devAddr, MPU6500_RA_INT_STATUS, MPU6500_INTERRUPT_PLL_RDY_INT_BIT, buffer);
  return buffer[0];
}
bool mpu6500GetIntDMPStatus()
{
  i2cdev_readBit(devAddr, MPU6500_RA_INT_STATUS, MPU6500_INTERRUPT_DMP_INT_BIT, buffer);
  return buffer[0];
}

// USER_CTRL register (DMP functions)

bool mpu6500GetDMPEnabled()
{
  i2cdev_readBit(devAddr, MPU6500_RA_USER_CTRL, MPU6500_USERCTRL_DMP_EN_BIT, buffer);
  return buffer[0];
}
void mpu6500SetDMPEnabled(bool enabled)
{
  i2cdev_writeBit(devAddr, MPU6500_RA_USER_CTRL, MPU6500_USERCTRL_DMP_EN_BIT, enabled);
}
void mpu6500ResetDMP()
{
  i2cdev_writeBit(devAddr, MPU6500_RA_USER_CTRL, MPU6500_USERCTRL_DMP_RESET_BIT, 1);
}

// BANK_SEL register

void mpu6500SetMemoryBank(uint8_t bank, bool prefetchEnabled, bool userBank)
{
  bank &= 0x1F;
  if (userBank)
    bank |= 0x20;
  if (prefetchEnabled)
    bank |= 0x40;
  i2cdev_writeByte(devAddr, MPU6500_RA_BANK_SEL, bank);
}

// MEM_START_ADDR register

void mpu6500SetMemoryStartAddress(uint8_t address)
{
  i2cdev_writeByte(devAddr, MPU6500_RA_MEM_START_ADDR, address);
}

// MEM_R_W register

uint8_t mpu6500ReadMemoryByte()
{
  i2cdev_readByte(devAddr, MPU6500_RA_MEM_R_W, buffer);
  return buffer[0];
}
void mpu6500WriteMemoryByte(uint8_t data)
{
  i2cdev_writeByte(devAddr, MPU6500_RA_MEM_R_W, data);
}
void mpu6500ReadMemoryBlock(uint8_t *data, uint16_t dataSize, uint8_t bank, uint8_t address)
{
  mpu6500SetMemoryBank(bank, true, true);
  mpu6500SetMemoryStartAddress(address);
  uint8_t chunkSize;
  uint16_t i;

  for (i = 0; i < dataSize;)
  {
    // determine correct chunk size according to bank position and data size
    chunkSize = MPU6500_DMP_MEMORY_CHUNK_SIZE;

    // make sure we don't go past the data size
    if (i + chunkSize > dataSize)
      chunkSize = dataSize - i;

    // make sure this chunk doesn't go past the bank boundary (256 bytes)
    if (chunkSize > 256 - address)
      chunkSize = 256 - address;

    // read the chunk of data as specified
    i2cdev_readBytes(devAddr, MPU6500_RA_MEM_R_W, chunkSize, data + i);

    // increase byte index by [chunkSize]
    i += chunkSize;

    // uint8_t automatically wraps to 0 at 256
    address += chunkSize;

    // if we aren't done, update bank (if necessary) and address
    if (i < dataSize)
    {
      if (address == 0)
        bank++;
      mpu6500SetMemoryBank(bank, true, true);
      mpu6500SetMemoryStartAddress(address);
    }
  }
}
bool mpu6500WriteMemoryBlock(const uint8_t *data, uint16_t dataSize, uint8_t bank, uint8_t address,
    bool verify)
{
  static uint8_t verifyBuffer[MPU6500_DMP_MEMORY_CHUNK_SIZE];
  uint8_t chunkSize;
  uint8_t *progBuffer;
  uint16_t i;

  mpu6500SetMemoryBank(bank, false, false);
  mpu6500SetMemoryStartAddress(address);

  for (i = 0; i < dataSize;)
  {
    // determine correct chunk size according to bank position and data size
    chunkSize = MPU6500_DMP_MEMORY_CHUNK_SIZE;

    // make sure we don't go past the data size
    if (i + chunkSize > dataSize)
      chunkSize = dataSize - i;

    // make sure this chunk doesn't go past the bank boundary (256 bytes)
    if (chunkSize > 256 - address)
      chunkSize = 256 - address;

    // write the chunk of data as specified
    progBuffer = (uint8_t *) data + i;

    i2cdev_writeBytes(devAddr, MPU6500_RA_MEM_R_W, chunkSize, progBuffer);

    // verify data if needed
    if (verify)
    {
      uint32_t j;
      mpu6500SetMemoryBank(bank, false, false);
      mpu6500SetMemoryStartAddress(address);
      i2cdev_readBytes(devAddr, MPU6500_RA_MEM_R_W, chunkSize, verifyBuffer);

      for (j = 0; j < chunkSize; j++)
      {
        if (progBuffer[j] != verifyBuffer[j])
        {
					 printf("Block write verification error, bank %d", bank);
           printf(", address %d", address);
           printf("!\r\nExpected:");
           for (j = 0; j < chunkSize; j++) {
						 printf("\t%02x",progBuffer[j]);
           }
           printf("\r\nReceived:");
           for (uint8_t j = 0; j < chunkSize; j++) {
						 printf("\t%02x",verifyBuffer[i + j]);
           }
           printf("\n");
					 return 0;
        }
      }
    }

    // increase byte index by [chunkSize]
    i += chunkSize;

    // uint8_t automatically wraps to 0 at 256
    address += chunkSize;

    // if we aren't done, update bank (if necessary) and address
    if (i < dataSize)
    {
      if (address == 0)
        bank++;
      mpu6500SetMemoryBank(bank, false, false);
      mpu6500SetMemoryStartAddress(address);
    }
  }
  return true;
}
bool mpu6500WriteProgMemoryBlock(const uint8_t *data, uint16_t dataSize, uint8_t bank,
    uint8_t address, bool verify)
{
  return mpu6500WriteMemoryBlock(data, dataSize, bank, address, verify);
}
#define MPU6500_DMP_CONFIG_BLOCK_SIZE 6
bool mpu6500WriteDMPConfigurationSet(const uint8_t *data, uint16_t dataSize)
{
  uint8_t *progBuffer, success, special;
  uint16_t i;

