NordicPlayground/nrf52-quadcopter/Firmware/drivers/mpu6500.c
  // config set data is a long string of blocks with the following structure:
  // [bank] [offset] [length] [byte[0], byte[1], ..., byte[length]]
  uint8_t bank=0;
  uint8_t offset=0;
  uint8_t length=0;
  for (i = 0; i < dataSize;)
  {
    bank = data[i++];
    offset = data[i++];
    length = data[i++];

		// write data or perform special action
		if (length > 0)
		{
			// regular block of data to write
			// printf("Writing config block to bank %d", bank);
			// printf(", offset %d", offset);
			// printf(", length=%d\r\n", length);
			progBuffer = (uint8_t *) data + i;
			success = mpu6500WriteMemoryBlock(progBuffer, length, bank, offset, true);
			i += length;
		}
		else
		{
			// special instruction
			// NOTE: this kind of behavior (what and when to do certain things)
			// is totally undocumented. This code is in here based on observed
			// behavior only, and exactly why (or even whether) it has to be here
			// is anybody's guess for now.
			special = data[i++];
			/*Serial.print("Special command code ");
			 Serial.print(special, HEX);
			 Serial.println(" found...");*/
			if (special == 0x01)
			{
				// enable DMP-related interrupts
				mpu6500SetIntZeroMotionEnabled(true);
				mpu6500SetIntFIFOBufferOverflowEnabled(true);
				mpu6500SetIntDMPEnabled(true);
				//i2cdev_writeByte(devAddr, MPU6500_RA_INT_ENABLE, 0x32);
				success = true;
			}
			else
			{
				// unknown special command
				success = false;
			}
		}

		if (!success)
		{
			return false; // uh oh
		}
	}
	return true;
}

bool mpu6500WriteProgDMPConfigurationSet(const uint8_t *data, uint16_t dataSize)
{
  return mpu6500WriteDMPConfigurationSet(data, dataSize);
}

// DMP_CFG_1 register

uint8_t mpu6500GetDMPConfig1()
{
  i2cdev_readByte(devAddr, MPU6500_RA_DMP_CFG_1, buffer);
  return buffer[0];
}
void mpu6500SetDMPConfig1(uint8_t config)
{
  i2cdev_writeByte(devAddr, MPU6500_RA_DMP_CFG_1, config);
}

// DMP_CFG_2 register

uint8_t mpu6500GetDMPConfig2()
{
  i2cdev_readByte(devAddr, MPU6500_RA_DMP_CFG_2, buffer);
  return buffer[0];
}
void mpu6500SetDMPConfig2(uint8_t config)
{
  i2cdev_writeByte(devAddr, MPU6500_RA_DMP_CFG_2, config);
}
